In [1]:
import pandas as pd

In [4]:
df=pd.DataFrame([])
print(df)

Empty DataFrame
Columns: []
Index: []

In [5]:
list=[1,2,3,4,5,6]
print(list)

[1, 2, 3, 4, 5, 6]

In [7]:
df1=pd.DataFrame(list)
print(df1)

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [8]:
df1

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [9]:
list1=[[1,2,3,4],[1,2,3,4,5],[5,6,7,8,6,4,2]]

In [10]:
df2=pd.DataFrame(list1)

In [11]:
print(df2)

   0  1  2  3    4    5    6
0  1  2  3  4  NaN  NaN  NaN
1  1  2  3  4  5.0  NaN  NaN
2  5  6  7  8  6.0  4.0  2.0

In [12]:
df2

   0  1  2  3    4    5    6
0  1  2  3  4  NaN  NaN  NaN
1  1  2  3  4  5.0  NaN  NaN
2  5  6  7  8  6.0  4.0  2.0

In [17]:
dic1={'id':[1,2,3,4,5],'Vaibhav':[1,2,3,4,5]}

In [18]:
df3=pd.DataFrame(dic1)
df3

   id  Vaibhav
0   1        1
1   2        2
2   3        3
3   4        4
4   5        5

In [27]:
dic2=[{'a':2,'b':3},{'a':345,'v':23,'b':1}]

In [28]:
df5=pd.DataFrame(dic2)
df5

     a  b     v
0    2  3   NaN
1  345  1  23.0

In [ ]:
dic3={'id':pd.Series([1,2,3,4,5])}
df1=pd.DataFrame( )